# -*- coding: utf-8 -*-
# @Author  : LouJingshuo
# @E-mail  : 3480339804@qq.com
# @Time    : 2023/7/26 14:36
# @Function: Infringement must be investigated, please indicate the source of reproduction!

classify_novel_dic = {
    '玄幻魔法': '以玄学为基础，以形\n而上的观念思维为\n主导，进行超自然力\n量演绎的一种小说',
    '穿越架空': '真实人物穿越到虚\n构的年代，是架空中\n发生的事情',
    '游戏竞技': '虚拟一个人物，构架\n一个天下无敌的模\n板，放在一个和现实\n差不多的环境里面',
    '历史军事': '往往以忠实于历史\n事实和逼真的细节\n等手段，艺术地再现\n历史风俗和社会概况',
    '科幻灵异': '幻想依靠科技在未\n来得以实现的极大\n可能，甚至有些“科学\n幻想”在多年以后，的\n确在科学上成为了现实',
    '社会文学': '表现时代斗争的重\n大题材，在创作一开\n始就运用一定的社\n会科学思想对社会\n生活进行理性的分析',
    '都市言情': '以男女之间的爱情\n为中心，以都市环境\n为背景，展开故事情\n节，反映社会生活',
    '同人动漫': '完全原著演绎，即文\n字版的漫画、电影\n或者其它',
    '武侠修真': '描写报恩复仇、除暴\n安良、剿匪平盗和民\n族斗争',
    '综合其他': '其它类型的小说'
}
